//SORTEX02 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,02)           00010017
//STEP1    EXEC  PGM=SORT                                               00020005
//SORTIN   DD    DSN=GR.F2401.ARQENT,DISP=SHR                           00030005
//SORTOUT  DD    DSN=GR.F2401.ARQSAI2,DISP=SHR                          00040020
//SYSOUT   DD    SYSOUT=*                                               00050010
//SYSIN    DD    *                                                      00050305
  SORT FIELDS=(21,09,CH,A)                                              00050415
  OUTREC FIELDS=(SEQNUM,3,ZD,START=01,INCR=1,1,71)                      00050621
