//F2401S08 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN   DD    DSN=GR.F2401.SORTLANC,DISP=SHR                         00040000
//SORTOUT  DD    SYSOUT=*                                               00050000
//SYSIN    DD    *                                                      00060000
 INREC FIELDS=(39,01,X,01,04,X,05,06,X,11,20,X,31,08)                   00070000
*INREC FIELDS=(39,01,X,01,04,X,05,06,X,C'NOME..: ',11,20,X,31,08)       00071001
 SORT FIELDS=COPY                                                       00080000
