//F2401S05 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN   DD    DSN=GR.F2401.ARQUIVOV,DISP=SHR                         00040001
//SORTOUT  DD    SYSOUT=*                                               00047000
//SYSIN    DD    *                                                      00048000
 SORT FIELDS=(05,04,CH,A)                                               00049001
