//F2401CMP JOB 'COMP COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  DELETE (GR.F2401.ARQVSAM) PURGE CLUSTER
  IF MAXCC=8 THEN SET MAXCC=0

  DEFINE CLUSTER -
     (NAME(GR.F2401.ARQVSAM) -
     IXD -
     VOL(PR39T7) -
     TRK(1 1) -
     FREESPACE(4 4) -
     SHR(2) -
     UNIQUE -
     RECORDSIZE(58 58) -
     KEYS(3 0) ) -
   DATA(NAME(GR.F2401.ARQVSAM.DATA)) -
   INDEX(NAME(GR.F2401.ARQVSAM.INDEX))
