      ******************************************************************
      * OBJETIVO...: BOOK DO ARQUIVO DE SAÍDA REGCAM PARA GRAVAR
      * PROGRAMADOR: WELLINGTON SOARES CORDEIRO
      * CONSULTORIA: FOURSYS
      * DATA.......: 22/07/2024
      ******************************************************************
       01  REG-REGCAM.
           10 REG-AGENCIA-REGCAM      PIC 9(04).
           10 REG-CONTA-REGCAM        PIC 9(05).
           10 REG-LANCAMENTO-REGCAM   PIC 9(08)V99.
