       IDENTIFICATION                          DIVISION.
      *=================================================================
       PROGRAM-ID.                             XXXX.
      *=================================================================
      * PROGRAMA    :
      * PROGRAMADOR : WELLINGTON SOARES CORDEIRO
      * ANALISTA    : IVAN SANCHES
      * CONSULTORIA : FOURSYS
      * DATA........: XX / XX / XXXX
      *-----------------------------------------------------------------
      * OBJETIVO....:
      *-----------------------------------------------------------------
      * ARQUIVOS                I/O                  INCLUDE/BOOK
      *-----------------------------------------------------------------
      * MODULOS.....:
      *
      *-----------------------------------------------------------------
      * ALTERACOES..:
      *=================================================================

      *=================================================================
       ENVIRONMENT                             DIVISION.
      *=================================================================

      *-----------------------------------------------------------------
       CONFIGURATION                           SECTION.
      *-----------------------------------------------------------------

       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.

      *-----------------------------------------------------------------

      *=================================================================
       DATA                                    DIVISION.
      *=================================================================

      *-----------------------------------------------------------------
       FILE                                    SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       WORKING-STORAGE                         SECTION.
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       01  FILLER                      PIC X(050)          VALUE
           "***** INICIO DA WORKING *****".
      *-----------------------------------------------------------------

      *-----------------------------------------------------------------
       01  FILLER                      PIC X(050)          VALUE
           "***** FIM DA WORKING *****".
      *-----------------------------------------------------------------

      *=================================================================
       PROCEDURE                               DIVISION.
      *=================================================================
       0000-PRINCIPAL.

           PERFORM 0100-INICIAR

           PERFORM 0200-PROCESSAR

           PERFORM 0300-FINALIZAR.

       0000-PRINCIPAL-FIM.EXIT.

      *-----------------------------------------------------------------
       0100-INICIAR                            SECTION.
      *-----------------------------------------------------------------



       0100-INICIAR-FIM.EXIT.

      *-----------------------------------------------------------------
       0200-PROCESSAR                          SECTION.
      *-----------------------------------------------------------------




       0200-PROCESSAR-FIM.EXIT.

      *-----------------------------------------------------------------
       0300-FINALIZAR                          SECTION.
      *-----------------------------------------------------------------



      *-----------------------------------------------------------------
       0300-FINALIZAR-FIM.EXIT.
      *-----------------------------------------------------------------
