       IDENTIFICATION                            DIVISION.
       PROGRAM-ID. MODULO.
      *=================================================================
      *== OBJETIVO    : MODULO PARA RECEBER DADOS
      *== PROGRAMADOR : WELLINGTON SOARES CORDEIRO
      *== DATA        : 27/07/2024
      *== CONSULTORIA : FOURSYS
      *=================================================================
      *== ALTERACAO   :
      *=================================================================
      *-----------------------------------------------------------------
      * ARQUIVOS   :           TIPO:                  INCLUDE/BOOK:
      *  LOGS.txt              EXTEND
      *-----------------------------------------------------------------
       ENVIRONMENT                               DIVISION.
       CONFIGURATION                             SECTION.
       INPUT-OUTPUT                              SECTION.
       FILE-CONTROL.
           SELECT LOGS ASSIGN TO "C:\ATIVIDADE3\LOGS.txt"
               FILE STATUS IS FS-LOGS.
      *-----------------------------------------------------------------
      *=================================================================
       DATA                                      DIVISION.
      *=================================================================
      *-----------------------------------------------------------------
       FILE                                      SECTION.
      *-----------------------------------------------------------------
       FD LOGS.
       01 REG-LOGS.
           05 REG-LOGS-DADOS               PIC X(78).
           05 REG-LOGS-DATA                PIC 9(08).
      *-----------------------------------------------------------------
       WORKING-STORAGE                           SECTION.
      *-----------------------------------------------------------------
       01  WRK-DATA.
           05 WRK-ANO                      PIC 9(04).
           05 WRK-MES                      PIC 9(02).
           05 WRK-DIA                      PIC 9(02).
       01  FS-LOGS                         PIC X(02).
      *-----------------------------------------------------------------
       LINKAGE                                   SECTION.
      *-----------------------------------------------------------------
       01  LNK-MODULO                      PIC X(78).
      *-----------------------------------------------------------------

      *=================================================================
       PROCEDURE                              DIVISION USING LNK-MODULO.
      *=================================================================

      *-----------------------------------------------------------------
       0001-PRINCIPAL                            SECTION.

      *-----------------------------------------------------------------
           PERFORM 0100-INICIAR.
           PERFORM 0200-PROCESSAR.
           PERFORM 0300-FINALIZAR.

      *-----------------------------------------------------------------
       0100-INICIAR                              SECTION.
      *-----------------------------------------------------------------
       ACCEPT WRK-DATA FROM DATE YYYYMMDD.
       OPEN EXTEND LOGS.

      *-----------------------------------------------------------------
       0100-INICIAR-FIM. EXIT.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       0200-PROCESSAR                            SECTION.
      *-----------------------------------------------------------------
           MOVE LNK-MODULO TO REG-LOGS-DADOS
           MOVE WRK-DATA   TO REG-LOGS-DATA
           WRITE REG-LOGS.
      *-----------------------------------------------------------------
       0200-PROCESSAR-FIM. EXIT.
      *-----------------------------------------------------------------
      *-----------------------------------------------------------------
       0300-FINALIZAR                            SECTION.
      *-----------------------------------------------------------------
       CLOSE LOGS
       GOBACK.
      *-----------------------------------------------------------------
       0300-FINALIZAR-FIM. EXIT.
      *-----------------------------------------------------------------
