//F2401S16 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN01 DD    DSN=GR.F2401.SORTBAS1,DISP=SHR                         00040000
//SORTIN02 DD    DSN=GR.F2401.SORTBAS2,DISP=SHR                         00041000
//SORTOUT  DD    SYSOUT=*                                               00050000
//SYSIN    DD    *                                                      00054000
  MERGE FIELDS=(01,05,CH,A)                                             00055001
  SUM FIELDS=NONE                                                       00056001
