//F2401EX3 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,01)           00010002
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030002
//SORTIN   DD    DSN=GR.F2401.ARQENT,DISP=SHR                           00040002
//SORTOUT  DD    DSN=GR.F2401.ARQSAI3,DISP=SHR                          00050206
//*SORTOUT  DD    SYSOUT=*                                              00050305
//SYSIN    DD    *                                                      00050403
 SORT FIELDS=COPY                                                       00050504
 INREC IFTHEN=(WHEN=(51,15,CH,EQ,C'COBOL'),OVERLAY=(51:C'COBMF'))       00050603
