//F2401S04 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN   DD    DSN=GR.F2401.SORTLANC,DISP=SHR                         00040000
//SORTOUT  DD    SYSOUT=*                                               00050000
//SYSIN    DD    *                                                      00060000
 SORT FIELDS=(01,10,CH,A)                                               00070000
 OUTREC FIELDS=(1,10ZD,TO=PD,LENGTH=6)                                  00071000
//*SORT FIELDS=(39,1,CH,A,1,10,CH,A)                                    00080000
