//F2401S13 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN   DD    DSN=GR.F2401.SORTLANC,DISP=SHR                         00040000
//SORTOUT  DD    SYSOUT=*                                               00050000
//SYSIN    DD    *                                                      00060000
 SORT FIELDS=COPY                                                       00070000
 OUTREC FIELDS=(1,38,4X,39,1,CHANGE=(8,C'C',C'CREDITO',C'D',C'DEBITO'), 00080001
        NOMATCH=((C'INVALIDO'))                                         00090001
