//F2401S11 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN   DD    DSN=GR.F2401.SORTLANC,DISP=SHR                         00040000
//SORTOUT  DD    SYSOUT=*                                               00050000
//SYSIN    DD    *                                                      00060000
 INREC IFTHEN=(WHEN=(39,1,CH,EQ,C'C'OVERLAY=(39:C'+')),                 00070000
       IFTHEN=(WHEN=(39,1,CH,EQ,C'D'OVERLAY=(39:C'-'))                  00071001
 SORT FIELDS=COPY                                                       00073000
