//F2401EXE JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
     DEFINE GDG -
           (NAME(GR.F2401.SVSAGDG) -
           NOEMPTY -
           NOSCRATCH -
           LIMIT(03))
/*
