//F2401EXE JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//CRIAR    EXEC PGM=ICEGENER
//SYSPRINT DD   SYSOUT=*
//SYSUT1   DD   DSN=GR.F2401.RELSTR(0),DISP=SHR
//SYSUT2   DD   DSN=GR.F2401.RELSTR(+1),
//         DISP=(NEW,CATLG,DELETE),
//         SPACE=(TRK,(1,1),RLSE),
//         DCB=*.CRIAR.SYSUT1
