//F2401S03 JOB '',CLASS=C,MSGCLASS=X,NOTIFY=F2401,TIME=(0,2)            00010000
//STEP1    EXEC  PGM=SORT                                               00020000
//SYSOUT   DD    SYSOUT=*                                               00030000
//SORTIN   DD    DSN=GR.F2401.SORTLANC,DISP=SHR                         00040002
//SORTOUT  DD    SYSOUT=*                                               00050002
//SYSIN    DD    *                                                      00060000
 SORT FIELDS=(1,10,CH,A)                                                00070002
//*SORT FIELDS=(39,1,CH,A,1,10,CH,A)                                    00080002
