      *================================================================*
       IDENTIFICATION                  DIVISION.
      *================================================================*
       PROGRAM-ID.                     F2401P12.
      *================================================================*
      *----------------------------------------------------------------*
      * VSAM- EXEMPLO DE LEITURA DE TODO O ARQUIVO
      *----------------------------------------------------------------*
      *================================================================*
       ENVIRONMENT                     DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       CONFIGURATION                   SECTION.
      *----------------------------------------------------------------*
       SPECIAL-NAMES.
           DECIMAL-POINT IS COMMA.
      *----------------------------------------------------------------*
       INPUT-OUTPUT                    SECTION.
      *----------------------------------------------------------------*
       FILE-CONTROL.
           SELECT ARQVSAM ASSIGN TO ARQVSAM
             ORGANIZATION  IS INDEXED
             ACCESS MODE   IS DYNAMIC
             RECORD KEY    IS REG-ARQVSAM-CHAVE
             FILE STATUS   IS FS-ARQVSAM.

      *----------------------------------------------------------------*
      *     ARQVSAM - CHAVE -> CODIGO DO CLIENTE 03 PRIMEIRAS POSICOES
      *----------------------------------------------------------------*

      *================================================================*
       DATA                            DIVISION.
      *================================================================*
      *----------------------------------------------------------------*
       FILE                            SECTION.
      *----------------------------------------------------------------*
       FD  ARQVSAM.
       COPY 'BOOKVSA'.

      *----------------------------------------------------------------*
       WORKING-STORAGE                 SECTION.
      *----------------------------------------------------------------*
       01  FS-ARQVSAM                  PIC  9(002).
       01  ACU-LIDOS                   PIC  9(002) COMP-3  VALUE ZEROS.
      *---------------------------------------------------------------
       LINKAGE                         SECTION.
      *---------------------------------------------------------------
       01  LNK-DADOS.
           05  LNK-DIGITO              PIC X(002).
           05  LNK-CHAVE               PIC X(003).
      *================================================================*
       PROCEDURE                       DIVISION USING LNK-DADOS.
      *================================================================*
      *----------------------------------------------------------------*
       0001-PRINCIPAL                  SECTION.
      *----------------------------------------------------------------*

           PERFORM 0100-INICIAR.

           PERFORM 0200-PROCESSAR.

           PERFORM 0300-FINALIZAR.

       0001-PRINCIPAL-FIM.             EXIT.

      *----------------------------------------------------------------*
       0100-INICIAR                    SECTION.
      *----------------------------------------------------------------*

           OPEN INPUT ARQVSAM.

           IF FS-ARQVSAM NOT EQUAL 0
              DISPLAY "ARQUIVO ARQVSAM NAO FOI ABERTO"
              GOBACK
           END-IF.

           MOVE LNK-CHAVE              TO REG-ARQVSAM-CHAVE.

       0100-INICIAR-FIM.               EXIT.

      *----------------------------------------------------------------*
       0200-PROCESSAR                  SECTION.
      *----------------------------------------------------------------*

           READ ARQVSAM.

           EVALUATE FS-ARQVSAM

           WHEN 00
              DISPLAY "FOUND: " REG-ARQVSAM

           WHEN 23
              DISPLAY "NOT FOUND"

           WHEN OTHER
              DISPLAY "ERRO NA LEITURA" FS-ARQVSAM

           END-EVALUATE.

       0200-PROCESSAR-FIM.             EXIT.
      *----------------------------------------------------------------*
       0300-FINALIZAR                  SECTION.
      *----------------------------------------------------------------*

           CLOSE ARQVSAM.

           IF FS-ARQVSAM NOT EQUAL 0
              DISPLAY "ERRO NO FECHAMENTO DO ARQUIVO ARQVSAM"
           END-IF.

           GOBACK.

       0300-FINALIZAR-FIM.             EXIT.
