       01  REG-ASSINA.                                                  00010000
           05 REG-CODIGO                PIC 9(003).                     00020000
           05 REG-NOME                  PIC X(020).                     00030000
           05 REG-EMAIL                 PIC X(020).                     00040000
           05 REG-STREAMING             PIC X(010).                     00050000
           05 REG-ASSINATURA            PIC 9(003)V99.                  00060000
