       01 REG-LANCAM.                                                   00010000
          05 REG-LANCAM-AGCONTA        PIC X(09).                       00020000
          05 REG-LANCAM-SALDO          PIC 9(06).                       00030000
          05 REG-LANCAM-TIPO           PIC X(01).                       00040000
