       01 REG-SVSA2208.
          05 REG-SVSA2208-AGENCIA PIC X(004).
          05 REG-SVSA2208-CONTA   PIC X(005).
          05 REG-SVSA2208-SALDO   PIC 9(010).
          05 REG-SVSA2208-DATA    PIC X(008).
