       01 REG-EVSA2208.
          05 REG-EVSA2208-AGENCIA PIC X(004).
          05 REG-EVSA2208-CONTA   PIC X(005).
          05 REG-EVSA2208-SALDO   PIC 9(010).
