//F2401CMP JOB 'COMP COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//ARQVSAM  DD DSN=GR.F2401.ARQVSAM,DISP=SHR
//SYSIN    DD   *
   PRINT INFILE(ARQVSAM) -
    CHAR                 -
    FROMKEY(X'F0F0F1') TOKEY(X'F0F0F6')
