//F2401CMP JOB 'COMP COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  REPRO  IFILE(ASSINA) OFILE(ARQVSAM)
//ASSINA   DD DSN=GR.F2401.ASSINA,DISP=SHR
//ARQVSAM  DD DSN=GR.F2401.ARQVSAM,DISP=SHR
