       01 REG-CLIENTES.                                                 00010000
          05 REG-CLIENTES-AGCONTA      PIC X(09).                       00020000
          05 REG-CLIENTES-NOME         PIC X(20).                       00030001
          05 REG-CLIENTES-SALDO        PIC 9(06).                       00040000
