       IDENTIFICATION DIVISION.
       PROGRAM-ID. PRGCOB1.
      *=====================================
      *== AUTOR: WELLINGTON SOARES CORDEIRO
      *== DATA: 25/06/2024
      *== OBJETIVO: 1° CONTATO COM COBOL
      *== OBSERVACOES:
      *== EMPRESA: XPTO
      *======================================
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.


       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "AULA 1 "
           STOP RUN.

       END PROGRAM PRGCOB1.
