//F2401C14 JOB 'COMPCOB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//*************************************************************
//*  JOB UTILIZADO PARA COMPILAR PROGRAMAS COBOL
//*************************************************************
// JCLLIB ORDER=GR.GERAL.PROCLIB
//COBCOMP  EXEC DFHCOBLB,LIB1=GR.F2401,NOME='F2401P14',LIB2=GR.GERAL
//LKED.SYSIN    DD   *
  NAME  F2401P14(R)
