//F2401CMP JOB 'COMP COB',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD   SYSOUT=*
//SYSIN    DD   *
  REPRO  IFILE(ARQVSAM) OFILE(SAIDA)
//ARQVSAM  DD DSN=GR.F2401.ARQVSAM,DISP=SHR
//SAIDA   DD DSN=GR.F2401.SAIDA,DISP=(NEW,CATLG,DELETE),
//        SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,
//        DCB=(LRECL=58,RECFM=FB,BLKSIZE=0)
