//F2401E09 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//****************************************************
//STEP001  EXEC PGM=F2401P09
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//ARQVSAM  DD DSN=GR.F2401.ARQVSAM,DISP=SHR
//SYSIN    DD *
017JOEL SANTANA        JOELS@UOL.COM.BR    NETFLIX   04990
