//F2401E11 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//****************************************************
//STEP001  EXEC PGM=F2401P11
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//ARQVSAM  DD DSN=GR.F2401.ARQVSAM,DISP=SHR
