//F2401E14 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,01)
//STEP001  EXEC PGM=F2401P14,PARM=('E005')
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//ARQVSAM  DD DSN=GR.F2401.ARQVSAM,DISP=SHR
//LOGERROS DD DSN=GR.F2401.LOGERROS,DISP=SHR
