//F2401E03 JOB 'EXECUT',CLASS=C,MSGCLASS=X,NOTIFY=&SYSUID,TIME=(0,02)
//STEP001  EXEC PGM=F2401P03
//STEPLIB  DD DSN=GR.GERAL.LOADLIB,DISP=SHR
//SYSOUT   DD SYSOUT=*
//ASSINA   DD DSN=GR.F2401.ASSINA,DISP=SHR
//LOGERROS DD DSN=GR.F2401.LOGERROS,DISP=SHR
