           01  WRK-MENSAGENS.
               05 WRK-ABERTURA-ARQ     PIC  X(30) VALUE
                  "ERRO NA ABERTURA DO ARQUIVO".

               05 WRK-FECHAMENTO-ARQ   PIC  X(30) VALUE
                  "ERRO NO FECHAMENTO DO ARQUIVO".

               05 WRK-ARQUIVO-VAZIO    PIC  X(30) VALUE
                  "ARQUIVO VAZIO".

               05 WRK-FIM-ARQ          PIC  X(30) VALUE
                  "FIM DE ARQUIVO".
